---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentWorksharingEnabledEventArgs
source: html/e8e6a008-e97e-ddc3-6ac1-f625e04ff314.htm
---
# Autodesk.Revit.DB.Events.DocumentWorksharingEnabledEventArgs

The event arguments used by the DocumentWorksharingEnabled event.

## Syntax (C#)
```csharp
public class DocumentWorksharingEnabledEventArgs : RevitAPISingleEventArgs
```